[
    {"date": "07/02/2025", "text": "<a href='https://hyeonmin-lee.github.io/'>Hyeonmin Lee</a> will be joining Hanyang University in South Korea as an assitant professor in March 2026. Hearty Congratulations!"},
    {"date": "06/02/2025", "text": "<font color='red'>I am always looking for motivated ph.d. students and postdocs. Please feel free to reach out to me. For a postdoc position, we have a funding opportunity at VT, called <a href='Virginia Tech Presidential Postdoctoral Fellowships'>Virginia Tech Presidential Postdoctoral Fellowships</a>.</span>", "top":true },
    {"date": "04/23/2025", "text": "Weitong received a travel grant from the IRTF to attend the IETF-123 meetings in Madrid, Spain."},
    {"date": "03/11/2025", "text": "My Ph.D. students, Hoang and Ishtiaq, will be working at Verisign and Facebook for their summer internship to work on DNSSEC and TLS."},
	{"date": "07/18/2024", "text": "NTIA published <a href='https://www.ntia.gov/fcc-filing/2024/ntia-comments-reporting-border-gateway-protocol-risk-mitigation-project'>comments</a> regarding the Reporting on Border Gateway Protocol (BGP) Risk Mitigation Progress Notice of Proposed Rulemaking (NPRM). RoVista is used to measure the Route Origin Validation (ROV) status in the United States."},
    {"date": "05/16/2024", "text": "FCC recently proposed <a href='https://docs.fcc.gov/public/attachments/DOC-402579A1.pdf'>Internet Routing Security Reporting Requirements</a>. In the accompanying <a href='https://docs.fcc.gov/public/attachments/DOC-402609A1.pdf'> fact sheet</a>, RoVista is mentioned as an example approach for understanding ROV!"},
    {"date": "04/13/2024", "text": "I am honored to be awarded <a href='https://www.nsf.gov/awardsearch/showAward?AWD_ID=2339378'>the NSF CAREER Award</a>; this proposal aims to enhance security protocols for Internet Routing and Naming."},
    {"date": "04/02/2024", "text": "I am honored to be awarded <a href='https://eng.vt.edu/about/faculty-awards-and-distinctions/deans-awards.html'>the Outstanding New Assistant Professor at the College of Engineering, Virginia Tech.</a>"},
    {"date": "04/02/2024", "text": "My Ph.D. student, Weitong, will be working at CableLabs for his summer internship to work on RPKI."},
    {"date": "03/25/2024", "text": "My Ph.D. student, Ishtiaq will be working at Meta for his summer internship to work on TLS and browser."},
    {"date": "02/13/2024", "text": "I gave a talk at <a href='https://www.youtube.com/watch?v=6i9pYDv0tNQ'>NANOG 90</a> to present our RPKI study and RoVista"},
    {"date": "11/21/2023", "text": "I am truly honored to be selected for the <a href='https://www.dns-oarc.net/'>2024 DNS-OARC Programme Committee</a>."},
    {"date": "11/09/2023", "text": "<a href='https://rovista.netsecurelab.org'>RoVista</a> is currently used by <a href='https://pulse.internetsociety.org/technologies'>Internet Society Pulse</a> for showing global RoV deployment."},
    {"date": "05/01/2023", "text": "Two Ph.D. students, Weitong and Protick will be working at <a href='https://www.thousandeyes.com/'>ThousdandEyes</a> and <a href='https://cloudflare.com'>Cloudflare</a> for their summer internship for RPKI and BGP research"},
    {"date": "05/01/2023", "text": "I am excited and honored to be a <a href='https://www.manrs.org/champions/'>2023 Research Mentor at the Mutually Agreed Norms for Routing Security (MANRS), Internet Society<a>."} 
]



